# Cleaning Data

In [3]:
# Data cleaning means fixing bad data in your data set
# Bad data could be:
# Empty cells, Data in wrong format,Wrong data, Duplicates

In [5]:
import pandas as pd
import numpy as np

In [15]:
df= pd.read_csv("pets.csv")
df

      Name      Breed          Color Height  Weight Date of Birth
0    Bella   Labrador          Brown     56    25.0      7/1/2013
1  Charlie     Poodle          Black    NaN    23.0     9/16/2016
2     Lucy       Chow     Chow Brown     46    22.0     8/25/2014
3   Cooper  Schnauzer           Gray     49     NaN    12/11/2011
4      Max   Labrador          Black   dkdk    29.0     1/20/2017
5   Stella  Chihuahua            Tan     18     2.0     4/20/2015
6   Bernie        St.  Bernard White     77    74.0     2/27/2018

In [13]:
df1 = df.dropna()
df1

     Name      Breed          Color Height  Weight Date of Birth
0   Bella   Labrador          Brown     56    25.0      7/1/2013
2    Lucy       Chow     Chow Brown     46    22.0     8/25/2014
4     Max   Labrador          Black   dkdk    29.0     1/20/2017
5  Stella  Chihuahua            Tan     18     2.0     4/20/2015
6  Bernie        St.  Bernard White     77    74.0     2/27/2018

In [17]:
df2 = df.fillna(50)
df2

      Name      Breed          Color Height  Weight Date of Birth
0    Bella   Labrador          Brown     56    25.0      7/1/2013
1  Charlie     Poodle          Black     50    23.0     9/16/2016
2     Lucy       Chow     Chow Brown     46    22.0     8/25/2014
3   Cooper  Schnauzer           Gray     49    50.0    12/11/2011
4      Max   Labrador          Black   dkdk    29.0     1/20/2017
5   Stella  Chihuahua            Tan     18     2.0     4/20/2015
6   Bernie        St.  Bernard White     77    74.0     2/27/2018

In [19]:
df['Height'].fillna(50, inplace=True)

In [21]:
df

      Name      Breed          Color Height  Weight Date of Birth
0    Bella   Labrador          Brown     56    25.0      7/1/2013
1  Charlie     Poodle          Black     50    23.0     9/16/2016
2     Lucy       Chow     Chow Brown     46    22.0     8/25/2014
3   Cooper  Schnauzer           Gray     49     NaN    12/11/2011
4      Max   Labrador          Black   dkdk    29.0     1/20/2017
5   Stella  Chihuahua            Tan     18     2.0     4/20/2015
6   Bernie        St.  Bernard White     77    74.0     2/27/2018

In [31]:
x = df['Weight'].mean()
print(x)

28.571428571428573

In [33]:
df['Weight'].fillna(x , inplace=True)

In [35]:
df

      Name      Breed          Color Height  Weight Date of Birth
0    Bella   Labrador          Brown     56    25.0      7/1/2013
1  Charlie     Poodle          Black     50    23.0     9/16/2016
2     Lucy       Chow     Chow Brown     46    22.0     8/25/2014
3   Cooper  Schnauzer           Gray     49    25.0    12/11/2011
4      Max   Labrador          Black   dkdk    29.0     1/20/2017
5   Stella  Chihuahua            Tan     18     2.0     4/20/2015
6   Bernie        St.  Bernard White     77    74.0     2/27/2018

In [37]:
weight_mean= df['Weight'].mean()
print(weight_mean)

28.571428571428573

In [43]:
weight_mean= df['Weight'].median()
print(weight_mean)

25.0

In [45]:
weight_mean= df['Weight'].max()
print(weight_mean)

74.0

In [47]:
weight_mean= df['Weight'].min()
print(weight_mean)

2.0

In [49]:
df3 = df[df['Weight'] == df['Weight'].max()]
df3

     Name Breed          Color Height  Weight Date of Birth
6  Bernie   St.  Bernard White     77    74.0     2/27/2018

In [53]:
df3 =df[df['Weight'] == df['Weight'].min()]
df3

     Name      Breed Color Height  Weight Date of Birth
5  Stella  Chihuahua   Tan     18     2.0     4/20/2015

In [55]:
df4 =df[df['Date of Birth'] == df['Date of Birth'].min()]
df4

  Name     Breed  Color Height  Weight Date of Birth
4  Max  Labrador  Black   dkdk    29.0     1/20/2017

In [57]:
df4 =df[df['Date of Birth'] == df['Date of Birth'].max()]
df4

      Name   Breed  Color Height  Weight Date of Birth
1  Charlie  Poodle  Black     50    23.0     9/16/2016

# removing duplicates values

In [62]:
df.drop_duplicates(subset= 'Color', inplace=True)
df

      Name      Breed          Color Height  Weight Date of Birth
0    Bella   Labrador          Brown     56    25.0      7/1/2013
1  Charlie     Poodle          Black     50    23.0     9/16/2016
2     Lucy       Chow     Chow Brown     46    22.0     8/25/2014
3   Cooper  Schnauzer           Gray     49    25.0    12/11/2011
5   Stella  Chihuahua            Tan     18     2.0     4/20/2015
6   Bernie        St.  Bernard White     77    74.0     2/27/2018

In [66]:
 df['Breed'].value_counts(sort=True)

Breed
Labrador     1
Poodle       1
Chow         1
Schnauzer    1
Chihuahua    1
St.          1
Name: count, dtype: int64